# Trabalho Prático 1

In [8]:
# pacotes
import io
import sqlite3
import pandas as pd

In [9]:
# Conexão e leitura BD
conn = sqlite3.connect('SQLite_Python.db')
cursor = conn.cursor()

f = io.open('database.sql', 'r', encoding='utf-8')
sql = f.read()
cursor.executescript(sql)

IntegrityError: UNIQUE constraint failed: Especies.nome

In [4]:
# Verificando conexão e db

query = """
SELECT * 
FROM Planetas
"""

df = pd.read_sql_query(query, conn)
df

,nome,periodo_rotacao,diametro,clima,gravidade,populacao,sois,luas,classe
0,Alderaan,24,12500,temperado,1.0,2000000000,1,1,terrestre
1,Yavin IV,24,10200,tropical,1.0,1000,1,0,lua
2,Hoth,23,7200,congelado,1.1,10,1,3,terrestre
3,Dagobah,23,8900,sombrio,1.0,0,1,1,terrestre
4,Bespin,12,118000,temperado,1.0,3600000000,1,3,gigante gasoso
...,...,...,...,...,...,...,...,...,...
67,Charros IV,31,10098,arido,1.0,250000000,1,4,terrestre
68,Nubia,29,10490,temperado,1.0,1200000000,1,1,terrestre
69,Halowan,26,6700,arido,0.7,360000,1,2,terrestre
70,Skako Menor,41,8900,temperado,2.0,400000000,2,3,terrestre
71,Thyferra,21,10221,tropical,1.0,117000000,1,2,terrestre

### Consultas de álgebra relacional

#### A0.πnome σplaneta =’Tatooine’ (Personagens)

In [5]:
query = """
SELECT nome
FROM Personagens
WHERE planeta ="Tatooine"
"""

df = pd.read_sql_query(query, conn)
df

                 nome
0      Luke Skywalker
1               C-3PO
2         Darth Vader
3           Owen Lars
4  Beru Whitesun lars
5               R5-D4
6   Biggs Darklighter
7    Anakin Skywalker
8      Shmi Skywalker
9         Cliegg Lars

#### A1.πnome_nave σcusto em creditos<500000 ∧ planeta=’Naboo’ (Naves ⋊⋉ Fabricantes)

In [17]:
query = """
SELECT N.nome
FROM Naves N JOIN Fabricantes F ON N.fabricante=F.nome
WHERE F.planeta ="Naboo" AND N.custo_em_creditos < 500000
"""

df = pd.read_sql_query(query, conn)
df

              nome
0    Naboo fighter
1  Rebel transport

#### A2.πnome especie σclassificacao=’reptiliano’ ∧ (clima = ’Arido’ ∨ clima = ’Umido’) (Especies ⋊⋉ Planetas)

In [13]:
query = """
SELECT E.nome
FROM Especies E JOIN Planetas P ON E.planeta = P.nome
WHERE (E.classificacao ="reptiliano") AND (P.clima = "arido" OR P.clima = "umido")
"""

df = pd.read_sql_query(query, conn)
df

          nome
0  Trandoshano
1  Neimoidiano

#### A3.πnome planeta σproduto = ’ambos’ (Planetas ⋊⋉ Fabricantes)

In [14]:
query = """
SELECT P.nome
FROM Planetas P JOIN Fabricantes F ON P.nome = F.planeta
WHERE produto = "ambos"
"""

df = pd.read_sql_query(query, conn)
df

       nome
0  Geonosis
1    Fresia
2      Kuat
3   Rothana
4    Lianna

#### A9.πnome,sois,luas σsois>luas ∧ luas>0 (Planetas)

In [8]:
query = """
SELECT nome, sois, luas
FROM Planetas
WHERE sois > luas AND luas > 0
"""

df = pd.read_sql_query(query, conn)
df

       nome  sois  luas
0  Mon Cala     2     1
1  Toydaria     2     1
2     Cerea     3     1
3       Dac     2     1

### Consultas de linguagem natural

#### B0. Liste (1) o nome dos personagens, (2) seu planeta de origem e (3) o planeta de sua esp ́ecie para os personagens n ̃ao humanos que nasceram em um planeta diferente do planeta de origem de sua esp ́ecie.

In [20]:
query = """
SELECT P.nome, P.planeta as planeta_origem_personagem, E.planeta as planeta_origem_especie
FROM Personagens P JOIN Especies E ON P.especie = E.nome
WHERE P.especie IS NOT "Humano" AND E.planeta IS NOT P.planeta
"""

df = pd.read_sql_query(query, conn)
df

         nome planeta_origem_personagem planeta_origem_especie      especie
0       C-3PO                  Tatooine              Coruscant       Droide
1       R2-D2                     Naboo              Coruscant       Droide
2       R5-D4                  Tatooine              Coruscant       Droide
3       IG-88                   Halowan              Coruscant       Droide
4  Darth Maul                  Dathomir               Iridonia       Zabrak
5  Adi Gallia                 Coruscant                Tholoth  Tholothiano
6      R4-P17                     Nubia              Coruscant       Droide

#### B2. Liste (1) o nome do fabricante, (2) a quantidade de naves e (3) a quantidade de veÍculos produzidos por cada fabricante que produza ambos os tipos de produtos

#### B3. Liste (1) o nome do personagem e (2) a altura dos personagens mais altos de cada esp ́ecie, ordenados em ordem crescente por altura.

#### B4. Liste (1) o nome do planeta e (2) a quantidade de personagens que nasceram nele para o planeta com o maior n ́umero de personagens.

#### B7. Liste (1) o nome dos fabricantes que produzem mais naves do que ve ́ıculos e (2) a quantidade de naves e (3) a quantidade de ve ́ıculos produzidos por cada um.